## Production: ECR
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 8 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                      NAME                       |
|--------|-------------------------------------------------|
| add    | `aws_ecr_repository.api-lambda`                 |
|        | `aws_ecr_repository.google-cidr`                |
|        | `aws_ecr_repository.heartbeat`                  |
|        | `aws_ecr_repository.notify_admin`               |
|        | `aws_ecr_repository.performance-test`           |
|        | `aws_ecr_repository.ses_receiving_emails`       |
|        | `aws_ecr_repository.ses_to_sqs_email_callbacks` |
|        | `aws_ecr_repository.sns_to_sqs_sms_callbacks`   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.api-lambda will be created
  + resource "aws_ecr_repository" "api-lambda" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "notify/api-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.google-cidr will be created
  + resource "aws_ecr_repository" "google-cidr" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "lambda/google-cidr"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.heartbeat will be created
  + resource "aws_ecr_repository" "heartbeat" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "notify/heartbeat"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.notify_admin will be created
  + resource "aws_ecr_repository" "notify_admin" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "notify/admin"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.performance-test will be created
  + resource "aws_ecr_repository" "performance-test" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "notify/performance-test"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.ses_receiving_emails will be created
  + resource "aws_ecr_repository" "ses_receiving_emails" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "notify/ses_receiving_emails"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.ses_to_sqs_email_callbacks will be created
  + resource "aws_ecr_repository" "ses_to_sqs_email_callbacks" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "notify/ses_to_sqs_email_callbacks"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.sns_to_sqs_sms_callbacks will be created
  + resource "aws_ecr_repository" "sns_to_sqs_sms_callbacks" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "notify/sns_to_sqs_sms_callbacks"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_lambda_ecr_arn                            = (known after apply)
  + api_lambda_ecr_repository_url                 = (known after apply)
  + google_cidr_ecr_arn                           = (known after apply)
  + google_cidr_ecr_repository_url                = (known after apply)
  + heartbeat_ecr_arn                             = (known after apply)
  + heartbeat_ecr_repository_url                  = (known after apply)
  + notify_admin_ecr_arn                          = (known after apply)
  + notify_admin_ecr_repository_url               = (known after apply)
  + performance_test_ecr_arn                      = (known after apply)
  + performance_test_ecr_repository_url           = (known after apply)
  + ses_receiving_emails_ecr_arn                  = (known after apply)
  + ses_receiving_emails_ecr_repository_url       = (known after apply)
  + ses_to_sqs_email_callbacks_ecr_arn            = (known after apply)
  + ses_to_sqs_email_callbacks_ecr_repository_url = (known after apply)
  + sns_to_sqs_sms_callbacks_ecr_arn              = (known after apply)
  + sns_to_sqs_sms_callbacks_ecr_repository_url   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.api-lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.google-cidr"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.heartbeat"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.notify_admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.performance-test"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.ses_receiving_emails"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.ses_to_sqs_email_callbacks"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.sns_to_sqs_sms_callbacks"]

25 tests, 17 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
